/*
 *	1. 변수 선언
 *		1) 변수	:	한 개의 데이터를 저장하는 메모리 공간 이름
 *										---------	주소	=>	저장한 데이트롤 읽기 / 쓰기
 *					=>	데이터 변경이 가능
 *		2) 상수	:	한 개의 데이터를 저장하는 메모리 공간	 이름
 *					=>	데이터 변경이 불가능
 *					=>	변수와 상수의 구은 final의 유무
 *							 ----
 *						----	final	데이터 형 상수명 = 값	= 값을 고정(변경(x))
 *						데이터 형 변수 명 = 값	=>	변경 가능
 *		3) 리터럴	:	실제 저장된 값( 메모리 ) *
 *	2. 변수 명칭법	=> 식별자 =>	같은 곳에서 같은 이름의 변수는 사용이 불가능하다.
 *		=>	알파벳 , 한글로 시작
 *			(대소문자 구분)
 *			int 국어 , 영어 , 수학
 *			int kor , ent , math , Kor
 *		=>	숫자 사용 ( 뒤에 사용이 가능)
 *			int kor1 , kor2 , kor3 , ...
 *		=>	키워드는 사용할 수 없다.
 *			int , byte , long , boolean , char , ....
 *		=>	공백이 있으면 안된다
 *			int a b	(x) , int ab (o)
 *		=>	특수문자 사용이 가능
 *			_ , $ ==> 언더바의 위치는 상관 없다.
 *			_가 앞에 있는 경우는 임시 변수 => _temp	=>	정렬
 *		=>	클래스 , 변수 , 상수 , 메소드 , 인터페이스 , 추상 클래스 . 배열 ...;
 *	3. 데이터 형 ( 데이터 타입 ) , 기본형
 *		형식)
 *			데이터 타입 변수명;
 *			----------------------------
 *						정수 
 *			----------------------------
 *						논리
 *			----------------------------
 *						문자	
 *			----------------------------
 *						실수
 *			----------------------------
 *						참조형 :	데이터를 여러 개 한 번에 저장하는 방법. 배열	/	클래스
 *	4. 각 데이터 형별 사용법
 *	5. 연산 처리 => 제어
 */
public class 변수_2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int kor , Kor;
	}

}
