/*
 * 						page
 * 		25 변수, 상수
 * 		26 형식, 식별자
 * 		28 변수 초기화
 * 		30 데이터형
 * 
 * 						사용자 요청 처리.
 * 		38 산술연산자
 * 		40 복합대입연산자
 * 		44 비교연산자
 * 		45 논리연산자
 * 		48 조건연산자
 * 		50 형변환
 * 		51 형변환
 * 
 * 		****	54		****
 * 		------------------------------------------------
 * 		변수		=>	응용	=>	연산자
 * 		연산자	=>	응용	=>	제어문
 * 		제어문	=>	응용	=>	메소드
 * 		메소드	=>	응용	=>	클래스
 */

public class 교재_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
